<a href="https://colab.research.google.com/github/mhz1123/internship/blob/master/ml_project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Step 1

1. Importing the required libraries

In [73]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
sns.set(style="ticks")

data = pd.read_excel('Bank_Personal_Loan_Modelling.xlsx','Data')

In [74]:
data.head(10)

   ID  Age  Experience  ...  CD Account  Online  CreditCard
0   1   25           1  ...           0       0           0
1   2   45          19  ...           0       0           0
2   3   39          15  ...           0       0           0
3   4   35           9  ...           0       0           0
4   5   35           8  ...           0       0           1
5   6   37          13  ...           0       1           0
6   7   53          27  ...           0       1           0
7   8   50          24  ...           0       0           1
8   9   35          10  ...           0       1           0
9  10   34           9  ...           0       0           0

[10 rows x 14 columns]

In [75]:
data.tail(10)

        ID  Age  Experience  ...  CD Account  Online  CreditCard
4990  4991   55          25  ...           0       0           1
4991  4992   51          25  ...           0       0           1
4992  4993   30           5  ...           0       0           0
4993  4994   45          21  ...           0       1           0
4994  4995   64          40  ...           0       1           0
4995  4996   29           3  ...           0       1           0
4996  4997   30           4  ...           0       1           0
4997  4998   63          39  ...           0       0           0
4998  4999   65          40  ...           0       1           0
4999  5000   28           4  ...           0       1           1

[10 rows x 14 columns]

In [76]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  5000 non-null   int64
 1   Age                 5000 non-null   int64
 2   Experience          5000 non-null   int64
 3   Income              5000 non-null   int64
 4   ZIP Code            5000 non-null   int64
 5   Family              5000 non-null   int64
 6   CCAvg               5000 non-null   float64
 7   Education           5000 non-null   int64
 8   Mortgage            5000 non-null   int64
 9   Personal Loan       5000 non-null   int64
 10  Securities Account  5000 non-null   int64
 11  CD Account          5000 non-null   int64
 12  Online              5000 non-null   int64
 13  CreditCard          5000 non-null   int64
dtypes: float64(1), int64(13)
memory usage: 547.0 KB

In [77]:
data.describe()

                ID          Age  ...       Online   CreditCard
count  5000.000000  5000.000000  ...  5000.000000  5000.000000
mean   2500.500000    45.338400  ...     0.596800     0.294000
std    1443.520003    11.463166  ...     0.490589     0.455637
min       1.000000    23.000000  ...     0.000000     0.000000
25%    1250.750000    35.000000  ...     0.000000     0.000000
50%    2500.500000    45.000000  ...     1.000000     0.000000
75%    3750.250000    55.000000  ...     1.000000     1.000000
max    5000.000000    67.000000  ...     1.000000     1.000000

[8 rows x 14 columns]

In [78]:
data.shape

(5000, 14)

In [79]:
data.isnull().sum()

ID                    0
Age                   0
Experience            0
Income                0
ZIP Code              0
Family                0
CCAvg                 0
Education             0
Mortgage              0
Personal Loan         0
Securities Account    0
CD Account            0
Online                0
CreditCard            0
dtype: int64

Step 2

Checking, if there is anything to clean in the data

dropping irrelevant columns

In [80]:
exp=data['Experience']
age = data['Age']
correlation= exp.corr(age)
correlation

0.9942148569683321

very high correlation in age and experience columns hence droppping the experience column as it is kind of use less in this case.
And also id column as it does help the model either

In [81]:
data = data.drop(['ID','Experience'],axis=1)
data.head()

   Age  Income  ZIP Code  ...  CD Account  Online  CreditCard
0   25      49     91107  ...           0       0           0
1   45      34     90089  ...           0       0           0
2   39      11     94720  ...           0       0           0
3   35     100     94112  ...           0       0           0
4   35      45     91330  ...           0       0           1

[5 rows x 12 columns]

Step 3

EDA

In [82]:
data.apply(lambda x: len(x.unique()))

Age                    45
Income                162
ZIP Code              467
Family                  4
CCAvg                 108
Education               3
Mortgage              347
Personal Loan           2
Securities Account      2
CD Account              2
Online                  2
CreditCard              2
dtype: int64

no of people with zero mortgage

In [83]:
data.query('Mortgage == "0"').Mortgage.count()

3462

In [84]:
data.query('CCAvg == "0"').CCAvg.count()

106

In [85]:
data.columns

Index(['Age', 'Income', 'ZIP Code', 'Family', 'CCAvg', 'Education', 'Mortgage',
       'Personal Loan', 'Securities Account', 'CD Account', 'Online',
       'CreditCard'],
      dtype='object')

In [ ]:
for column in data.columns:
     print("\n" + column)
     print(data[column].value_counts())